In [1]:
import pandas as pd

    
df = pd.read_csv('adult.data.csv')
df.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [2]:
 # How many of each race are represented in this dataset
race_count = df['race'].value_counts()
race_count

White                 27816
Black                  3124
Asian-Pac-Islander     1039
Amer-Indian-Eskimo      311
Other                   271
Name: race, dtype: int64

In [3]:
# What is the average age of men?
average_age_men = df['age'].groupby(df['sex']=='Male').mean()
average_age_men.round(1)

sex
False    36.9
True     39.4
Name: age, dtype: float64

In [4]:
# What is the percentage of people who have a Bachelor's degree?

percentage_bachelors = (df['education']=='Bachelors').value_counts(normalize=True)*100
percentage_bachelors.round(1)

False    83.6
True     16.4
Name: education, dtype: float64

In [5]:
#whats the percentage of people with or without advanced education and make more than 50k

filt_education =(df["education"] == "Bachelors") | (df["education"] == "Masters") | (df["education"] == "Doctorate")
higher_education = df[filt_education]
lower_education = df[-filt_education]

higher_education.head(3)

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [6]:
#percentage of people without advanced education but make more tha 50k

lower_education.head(3)

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
6,49,Private,160187,9th,5,Married-spouse-absent,Other-service,Not-in-family,Black,Female,0,0,16,Jamaica,<=50K

In [7]:
#percentage of salary with 50k
higher_education_rich = (df['salary']=='>50K').value_counts(normalize=True)*100
higher_education_rich.round(1)

False    75.9
True     24.1
Name: salary, dtype: float64

In [8]:
#percentage of salary lower >=50

lower_education_rich = (df['salary']=='<=50K').value_counts(normalize=True)*100
lower_education_rich.round(1)

True     75.9
False    24.1
Name: salary, dtype: float64

In [9]:
#minimun number of hours per person
min_work_hours = df['hours-per-week'].min()
min_work_hours

1

In [10]:
# What percentage of the people who work the minimum number of hours per week have a salary of >50K?
num_min_work = (df['hours-per-week']== 1).value_counts()
num_min_work

False    32541
True        20
Name: hours-per-week, dtype: int64

In [11]:
rich_percentage = df[(df['hours-per-week'] == 1) & (df['salary'] == '>50K')].shape[0] / num_min_work * 100                                          
rich_percentage.round(1)

False     0.0
True     10.0
Name: hours-per-week, dtype: float64

In [12]:
# What country has the highest percentage of people that earn >50K?

highest_earning_country = df['native-country'].groupby(df['salary']== '>50K').value_counts()
highest_earning_country

salary  native-country
False   United-States      21999
        Mexico               610
        ?                    437
        Philippines          137
        Puerto-Rico          102
                           ...
True    Laos                   2
        Nicaragua              2
        Peru                   2
        Trinadad&Tobago        2
        Honduras               1
Name: native-country, Length: 82, dtype: int64

In [13]:
highest_earning_country_percentage = highest_earning_country = df['native-country'].groupby(df['salary']== '>50K').value_counts(normalize=True)*100
highest_earning_country_percentage.round(3)

salary  native-country
False   United-States      88.993
        Mexico              2.468
        ?                   1.768
        Philippines         0.554
        Puerto-Rico         0.413
                            ...
True    Laos                0.026
        Nicaragua           0.026
        Peru                0.026
        Trinadad&Tobago     0.026
        Honduras            0.013
Name: native-country, Length: 82, dtype: float64

In [35]:
# Identify the most popular occupation for those who earn >50K in India.
top_In_occupation = df.groupby(["native-country", "salary", "occupation"])["age"].count().loc["India", ">50K"].sort_values(ascending=False)
top_In_occupation.index[0]

'Prof-specialty'